/**
 * @mainpage
 * # Загальне завдання
 * 1. **Розробити** функцію, яка зчитує список з файлу
 * 2. **Розробити** функцію, яка записує дані(список) у файлу;
 * 3. **Розробити** функцію, яка виводить список на екран;
 * 4. **Розробити** функцію, яка буде сортувати список за заданим критерієм;
 * 5. **Розробити** функцію, яка буде знаходити заданий еолемент у списку;
 * 6. **Розробити** функцію, яка видаляє елемент зі списку;
 * 7. **Розробити** функцію, яка вставляє новий елемент по індексу;
 * 8. **Реалізувати** діалоговий режим спілкування з користувачем.
 *
 * @author Zhuravlev Y.
 * @date 29-may-2021
 * @version 1.0
 */

/**
 * @file main.c
 * @brief Файл з демонстрацією роботи роботи розроблених функцій
 *
 * @author Zhuravlev Y.
 * @date 28-may-2021
 * @version 1.0
 */

#include "list.h"
#include "data.h"
#include "ui.h"
// #include "ui.h"

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - викликає функцію запуску діалогового режиму
 * @return успішний код повернення з програми (0)
 */
int main()
{
    start();

    return 0;
}